/**
 * Created by vlad on 30.11.2015.
 */


"use strict";

//-------Объявляем переменные-------------

var a,b, c, Discriminant ,x1,x2,D,ProverkaX1, ProverkaX2;


//-------Вводим значение для уравнения------------
a = +prompt("введите а");
b = +prompt("введите b");
c = +prompt("введите с");

//--------Выводим уравнение с задаными значениями--------------

alert( a + "x*x" +"+"+ b + "x" + "+" + c + "= 0");


//----------Задаем уравнение по которой считаем Дискриминант------

D = (b*b) - (4*a*c);
Discriminant = Math.sqrt(D);
//-----------Выводим значение дискриминанта----------

alert( "Discriminant = " + Discriminant );

//-----------Считаем корни, когда дискриминант больше 0

if(Discriminant > 0){

    x1 = (-b + Discriminant)/(2*a);
    x2 = (-b - Discriminant)/(2*a);
    //---------Проверка корней -------------
    ProverkaX1 = a *(x1*x1) + b * x1 + c;
    ProverkaX2 = a *(x2*x2) + b * x2 + c;


    alert("Решение квадратного уравнение\n"+" С помощью дискриминанта\n"+" Ваше уравнение : "+ a + "x*x" +"+"+ b + "x" + "+" + c + "= 0"
        +"\nКорни уравнения, когда дискриминант больше 0\n x1= " + x1 + "\n x2= " + x2 + "\nПроверка х1 = " + ProverkaX1 +  "\nПроверка х2 = " + ProverkaX2);

}
//-----------Считаем корни, когда дискриминант равен 0

else if (Discriminant == 0) {
    x1 = -b / (2 * a);


    //-------Проверка корней -------
    ProverkaX1 = a *(x1*x1) + b * x1 + c;


    alert("Решение квадратного уравнение\n"+" С помощью дискриминанта\n"+" Ваше уравнение : "+ a + "x*x" +"+"+ b + "x" + "+" + c + "= 0"
        +"\nКорни уравнения, когда дискриминант равен 0\n x1= " + x1 + " x2= " +  "\nПроверка х1 = " + ProverkaX1  );
}
//-----------Выводим текст если дискреминант меньше 0
else {

    alert("Дискриминант меньше 0 корней нету ");
}
